# -*- mode: org; mode: auto-fill; -*-
#+TITLE:   Expected results example

#+name: hello_test
#+begin_src ruby :results output
10.times do 
  puts "hola"
end
#+end_src

#+RESULTS: hello_test
#+begin_example
hello
hello
hello
hello
hello
hello
hello
hello
hello
hello
#+end_example

This one would fail near christmas, outside of Japan,
when the site is down, or there is a change in the rss.xml being provided.

#+name: christmas_check
#+begin_src sh :results output
curl https://isitchristmas.com/rss.xml 2> /dev/null | grep title
# curl isitchristmastyet.com 2> /dev/null
#+end_src

#+RESULTS: fetch_google
#+begin_example
    <title>Is It Christmas?</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
          <title>いいえ</title>
#+end_example
